export default {
    profile: `  <span class="c-vscode-function"><a target="_blank" href="https://golang.org/">Go</a></span>와 <span class="c-vscode-function"><a target="_blank" href="https://vuejs.org/">Vue</a></span>의 열렬한 팬이며, 하나의 서비스를 제공하기 위한 아키텍쳐 설계 & 개발 & 배포 & 서버 운영이 모두 가능한 <span class="c-vscode-function f-700"><a target="_blank" href="https://brunch.co.kr/@supims/17">풀스택 웹 개발자</a></span><span class="text-linethrough o-50 c-gray">잡부</span>입니다.

  현재 주로 하는 일은 SPA (혹은 PWA) (+ 필요시 SSR) 및 백엔드 API 개발입니다.

  DB조회하는 backoffice페이지 같은건 한나절이면 간단하게 만들고 백엔드와 연동가능할 정도로 수없이 만들어왔으며, REST API와의 연동용도로 개인적으로 제작해서 사용중인 테이블 프레임워크도 있습니다.(ng-table같은...)

  orm, cache, transaction, router, controller, context, session, cron, auth... 등등 모던 웹에 필요한 요소들을 이해하고 있고 필요에 따라 어느 언어로든(ㄹㅇ?) 구현, 작성하고 완성된 서비스를 배포할 수 있습니다.

  전통적인 SSR 언어들인 PHP, JSP 등이나, Nuxt와 같은 미들웨어를 통한 SSR 모두 익숙하며, SEO에 대한 이해가 있습니다.
(prerender, dynamic render, ssr...)

  대학 시절 <span class="text-linethrough o-50 c-gray">혹독한 고문을 통해</span> 재귀적인 사고에도 익숙해져서 LISP 계통 언어도 잘 하는 편입니다.

  현재 부 관리자로 활동하는 카카오톡 수다방이 2개 있으며 (Go, Vue) '땔감'이라는 닉네임으로 활발하게 활동중입니다.

  여가시간에는 개인적인 토이 프로젝트를 진행하거나 YouTube에서 computerphile, 포프tv등 관심분야의 영상들을 찾아보면서 좋은 개발자가 되기 위한 철학들이나 좋은 코딩습관, 학창시절 배웠던 알고리즘이나 컴퓨터 과학 이론들 등을 보고 배우고 익히는 복습하는 것을 즐깁니다.

<div class="hr m-t-16 m-b-16"></div>
<span class="c-vscode-function">일할 때 항상 생각하는 것들 & 경험들:</span>
<div class="f-12">
- 코드를 읽는 것 자체가 주석이 될 수 있을 정도의 직관적인 변수, 함수 네이밍
- 성능이 매우 중요한게 아니라면 함수콜이 늘어나더라도 로직을 최대한 잘게 쪼개서 보기좋게
- 반복적인 요소는 가급적 템플릿이 아닌 스크립트쪽에
- 두 군데 이상에서 사용되는 것이라면 함수로
- 내가 짠 코드를 나중에 남이 리팩토링하는 일이 최대한 없도록 하자
- 눈 앞에 닥친 일은 특정한 경우만을 처리하는 것일지라도, 케이스가 추가되는 경우를 위해 처음부터 generic하게 하는게 건강에 좋더라
- 서비스 규모가 커져서 이 함수가 나중에 몇십만번, 몇천만번 불려도 괜찮을까?
- 내가 edge 케이스를 하나 더 떠올릴 때마다 회사의 QA 비용이 줄어든다
- 현재 이 코드는 렌더링시 잠재적으로 계산 복잡도의 차수를 올리는가?
- 정의된 모델이 아닌 통계를 위한 값은 raw query
- 성능 문제가 크리티컬한 경우가 아니면 Query Builder
- query는 최소한으로 (n+1 문제 등은 가급적 절대 피해야 하기 때문에 습관적으로 배열을 대상으로 자식 모델들을 populate해주는 함수를 짜고(WHERE in), 이 함수를 wrapping해서 단일 대상을 populate하는 함수를 만드는 편.)
- 이것은 hook이나 service레벨로 빠질 수 있는 전역 수준의 로직인가?
- 이것은 관리 포인트가 늘어나는 것을 감안하고도 도입할만한 시스템인가?
- Map? Array?
</div>
<div class="hr m-t-16 m-b-16"></div>
<span class="c-vscode-function">같이 일하고 싶은 동료는</span>
<div class="f-12">
- 합리적인 분
- 자기 주장이 어느정도 강한 분 (제가 약해서... 터무니 없는 제안이 아니면 굉장히 잘 설득당하는 편입니다.)
- 문제를 정의하고 가설을 세우는 데 강한, 데이터를 잘 하는 분 (저는 잘 정의된 문제를 해결하는 데 강점이 있습니다.)
- 프로덕트를 빠르게 이해하고 Objective나 KPI를 올바로 (혹은 합리적으로) 설정할 수 있는 분
- 개발을 아는 분
- 픽셀 단위까지 철저하신분
- 의사결정이 빠른 분 (빠르게 실패하고 빠르게 수정하는 것을 좋아합니다. 물론 빠르게 성공하면 베스트...)
- 한정된 리소스에서 사안의 경중을 빠르게 설정해서 포기할 것과 반드시 가져가야 할 것을 구별할 수 있는 분
- 주변에서 좋다는 여러 방법론 & 지론들 이것저것 다 시도했다가 흐지부지되는 사람보다는, 자기만의 철학이 있고 그것으로 유의미한 결과를 내본 경험이 있는 분 (성공이든 실패이든)
- 디자인에 일관성이 있으신분 (일관성과 패턴만 있다면 디자인이나 기획이 자주 바뀌는 것은 상관없습니다.)
- 어떤 기능이 왜 필요한지, 필요하다면 어떤게 긍정적 UX가 될지 고민하시는 분
- 개발자의 경우, 일단 부정적 의견부터 내는 사람보다는 (일을 안하는 성향의 사람일 가능성이 크다고 생각합니다) '해보자' '가능하다'라는 말을 주로 먼저 하는 성향의 분들
</div>`
}